; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v3 - type_2 ?v8 - type_3)
 	      (pred_4 ?v7 - object ?v8 - type_3)
	      (pred_1 ?v3 - type_2 ?v5 - type_1)
	      (pred_3 ?v3 - type_2 ?v7 - object ?v5 - type_1))

   (:action op_1
       :parameters  (?v3 - type_2 ?v1 ?v4 - type_3)
       :precondition (and  (pred_2 ?v3 ?v1))
       :effect (and  (pred_2 ?v3 ?v4)
		     (not (pred_2 ?v3 ?v1))))

   (:action op_2
       :parameters (?v3 - type_2 ?v6 - object ?v2 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v2) (pred_2 ?v3 ?v2) (pred_1 ?v3 ?v5))
       :effect (and (pred_3 ?v3 ?v6 ?v5)
		    (not (pred_4 ?v6 ?v2)) 
		    (not (pred_1 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_2 ?v6 - object ?v2 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v6 ?v5) (pred_2 ?v3 ?v2))
       :effect (and (pred_4 ?v6 ?v2)
		    (pred_1 ?v3 ?v5)
		    (not (pred_3 ?v3 ?v6 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_2
obj_03 obj_07 - type_1
obj_08 obj_04 obj_09 - type_3
obj_01 obj_06 obj_05 - object)
(:init
(pred_2 obj_02 obj_09)
(pred_1 obj_02 obj_03)
(pred_1 obj_02 obj_07)
(pred_4 obj_01 obj_08)
(pred_4 obj_06 obj_09)
(pred_4 obj_05 obj_08)
)
(:goal
(and
(pred_4 obj_01 obj_04)
(pred_4 obj_06 obj_09)
(pred_4 obj_05 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_02 ?b obj_07))))
)
)

; plan
1. (op_1 obj_02 obj_09 obj_08)
   deleted: (pred_2 obj_02 obj_09)
   added: (pred_2 obj_02 obj_08)
   goals met: 2 of 3
2. (op_2 obj_02 obj_01 obj_08 obj_03)
   deleted: (pred_4 obj_01 obj_08) (pred_1 obj_02 obj_03)
   added: (pred_3 obj_02 obj_01 obj_03)
   goals met: 2 of 3
3. (op_1 obj_02 obj_08 obj_04)
   deleted: (pred_2 obj_02 obj_08)
   added: (pred_2 obj_02 obj_04)
   goals met: 2 of 3
4. (op_3 obj_02 obj_01 obj_04 obj_03)
   deleted: (pred_3 obj_02 obj_01 obj_03)
   added: (pred_4 obj_01 obj_04) (pred_1 obj_02 obj_03)
   goals met: 3 of 3
